@kayrus Yes, your change resolves the issue but I've another issue with the monitor: `Error: Unable to retrieve parent pool () for the monitor: Resource not found`

Caused by:
```
  # module.api_load-balancer.openstack_lb_monitor_v2.api_monitor must be replaced
-/+ resource "openstack_lb_monitor_v2" "api_monitor" {
        admin_state_up = true
        delay          = 20
        expected_codes = "200-499"
      ~ http_method    = "GET" -> (known after apply)
      ~ id             = "a6b32649-c191-46c5-8fd2-c80643fe06b9" -> (known after apply)
        max_retries    = 5
      - name           = "a6b32649-c191-46c5-8fd2-c80643fe06b9" -> null
      + pool_id        = "43d790ca-b86f-4f94-9fb3-1a40c4092c07" # forces replacement
      ~ region         = "AMS" -> (known after apply)
      ~ tenant_id      = "fb679d1d8c324e1dbf71a964ea1095fb" -> (known after apply)
        timeout        = 10
        type           = "HTTPS"
        url_path       = "/"
    }
```

Can't determine the pool ID and fails.

Debug:
```
2019-08-15T11:34:36.524+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: 2019/08/15 11:34:36 [DEBUG] OpenStack Region is: AMS
2019-08-15T11:34:36.524+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: 2019/08/15 11:34:36 [DEBUG] OpenStack Endpoint for network: https://network.openstack.cloudvps.com/v2.0/
2019-08-15T11:34:36.524+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: 2019/08/15 11:34:36 [DEBUG] OpenStack Request URL: GET https://network.openstack.cloudvps.com/v2.0/lbaas/pools/43d790ca-b86f-4f94-9fb3-1a40c4092c07
2019-08-15T11:34:36.524+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: 2019/08/15 11:34:36 [DEBUG] OpenStack Request Headers:                                                                                                                     2019-08-15T11:34:36.524+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: Accept: application/json
2019-08-15T11:34:36.524+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: User-Agent: Terraform/0.12.2 gophercloud/2.0.0
2019-08-15T11:34:36.524+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: X-Auth-Token: ***
2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: 2019/08/15 11:34:36 [DEBUG] OpenStack Response Code: 404
2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: 2019/08/15 11:34:36 [DEBUG] OpenStack Response Headers:
2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: Content-Length: 112
2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: Content-Type: application/json; charset=UTF-8
2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: Date: Thu, 15 Aug 2019 09:36:46 GMT
2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: Server: nginx
2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: X-Openstack-Request-Id: req-8b0cbd03-d2c7-4c3e-b8e4-28170884c6ec
2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: 2019/08/15 11:34:36 [DEBUG] OpenStack Response Body: {                                                                                                                     2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2:   "code": "404 Not Found",
2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2:   "message": "The resource could not be found.\u003cbr /\u003e\u003cbr /\u003e\n\n\n",
2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2:   "title": "Not Found"
2019-08-15T11:34:36.648+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: }
2019/08/15 11:34:36 [DEBUG] module.api_load-balancer.openstack_lb_monitor_v2.api_monitor: apply errored, but we're indicating that via the Error pointer rather than returning it: Unable to retrieve parent pool () for the monitor: Resource not found
2019/08/15 11:34:36 [TRACE] module.api_load-balancer: eval: *terraform.EvalWriteState
2019/08/15 11:34:36 [TRACE] EvalWriteState: writing current state object for module.api_load-balancer.openstack_lb_monitor_v2.api_monitor
2019-08-15T11:34:36.861+0200 [DEBUG] plugin.terraform-provider-openstack_v1.21.2: 2019/08/15 11:34:36 [DEBUG] OpenStack Response Code: 200   
```